fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>Специалисты</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// +++
	// ВКМ Супонев - Дипломный проект
	//
	// Заполнение списка выбора времени - Кратность 1 час
		
	ЗаполнитьВыпадающийСписокНачала();
	
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРабот) Тогда
		ЗаполнитьВыпадающийСписокОкончания();
	КонецЕсли;
	
	// Отображение только Специалистов на форме

	СписокСпецов = ПолучитьСписокСпециалистовНаСервере();

	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", СписокСпецов);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(НовыйПараметр);

	Элементы.Специалист.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	// ВКМ Супонев - Дипломный проект
	// +++
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// +++
	// ВКМ Супонев - Дипломный проект
	// Обращение к видимости реквизитовв при Абонентском Обслуживании
	
	ВКМ_ОбновитьПоказателиДоговораНаСервере();
	
	// ВКМ Супонев - Дипломный проект
	// +++
КонецПроцедуры



&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

	// +++
	// ВКМ Супонев - Дипломный проект
	// Проверка даты проведения работ

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьДатуПроведенияРабот(Отказ);
КонецПроцедуры

	// ВКМ Супонев - Дипломный проект
	// +++
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
	
	// +++
	// ВКМ Супонев - Дипломный проект
	// Обращение к видимости реквизитовв при Абонентском Обслуживании
	
&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ВКМ_ОбновитьПоказателиДоговораНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Объект.Договор = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	УстановитьОтборДоговоров();
	ВКМ_ОбновитьПоказателиДоговораНаСервере();
	
КонецПроцедуры

	// Проверки даты и времени проведения работ
	
&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	ПроверитьДатуПроведенияРабот();
КонецПроцедуры
	
&НаКлиенте
Процедура ВремяНачалаРаботПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРабот) Тогда
		Если Не ЗначениеЗаполнено(Объект.ВремяОкончанияРабот) Тогда
			Объект.ВремяОкончанияРабот = Объект.ВремяНачалаРабот + 3600;
		ИначеЕсли Объект.ВремяОкончанияРабот <= Объект.ВремяНачалаРабот Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Внимание! Время окончания работ не может быть меньше или равно времени начала!");
			Объект.ВремяОкончанияРабот = Объект.ВремяНачалаРабот + 3600;
		КонецЕсли;
		ЗаполнитьВыпадающийСписокОкончанияНаСервере();
	Иначе
		Объект.ВремяОкончанияРабот = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	// +++
	// ВКМ Супонев - Дипломный проект

	// показываю Только договоры абон.обсл.
	
&НаКлиенте
Процедура УстановитьОтборДоговоров()
	
	НовыйОтбор = Новый Массив;
	НовыйОтбор.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.Клиент));
	НовыйОтбор.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")));
	
	Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйОтбор);
	
КонецПроцедуры

	// показываю Подсказку по Договору абон.обсл.
	
&НаСервере
Процедура ВКМ_ОбновитьПоказателиДоговораНаСервере()
	
	Если Объект.Договор.Пустая() Тогда
		Элементы.ГруппаИнфоАбонПлаты.Видимость = Ложь;
		ВКМ_АбонПлатаПредставление = 0;
		ВКМ_СтоимостьЧасаПредставление = 0;
		Возврат;
	КонецЕсли;
		
	Список = "ВидДоговора, ВКМ_СуммаАбонентскойПлаты, ВКМ_СтоимостьЧасаРаботы, ВКМ_ОкончаниеДействияДоговора";
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, Список);
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.ВКМ_ОкончаниеДействияДоговора) 
		И РеквизитыДоговора.ВКМ_ОкончаниеДействияДоговора < НачалоДня(ТекущаяДатаСеанса) Тогда
		Элементы.ГруппаИнфоАбонПлаты.ЦветФона = WebЦвета.СветлоРозовый;
	Иначе
		Элементы.ГруппаИнфоАбонПлаты.ЦветФона = WebЦвета.СветлоЗеленый;  
	КонецЕсли;

	Если РеквизитыДоговора.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ГруппаИнфоАбонПлаты.Видимость = Истина;
		ВКМ_АбонПлатаПредставление = РеквизитыДоговора.ВКМ_СуммаАбонентскойПлаты;
		ВКМ_СтоимостьЧасаПредставление = РеквизитыДоговора.ВКМ_СтоимостьЧасаРаботы;
	Иначе
		Элементы.ГруппаИнфоАбонПлаты.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

	// Заполнение даты, время начала - окончанияя работ
	
&НаКлиенте
Процедура ПроверитьДатуПроведенияРабот(Отказ = Ложь)
	
	ТекущаяДатаНаСервере = ОбщегоНазначенияКлиент.ДатаСеанса(); 
	ЗавтрашнийДень = НачалоДня(ТекущаяДатаНаСервере + 86400);
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПроведенияРабот) Тогда
		Объект.ДатаПроведенияРабот = ЗавтрашнийДень;
		Возврат;
	КонецЕсли;
	
	Если НачалоДня(Объект.ДатаПроведенияРабот) < ЗавтрашнийДень Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата проведения работ изменена на ближайшую возможную (завтра).");
		Объект.ДатаПроведенияРабот = ЗавтрашнийДень;
	КонецЕсли;

КонецПроцедуры

&НаСервере         // заполняю Время на Сервере, т.к. создание Нового док-та тоже на сервере
Процедура ЗаполнитьВыпадающийСписокНачала()
	
	БазоваяДата = '00010101'; 
	ЭлементНачало = Элементы.ВремяНачалаРабот;
	ЭлементНачало.СписокВыбора.Очистить();
	
	// Начало -  с 8 до 20
	Для Час = 8 По 20 Цикл
		ЗначениеВремени = БазоваяДата + (Час * 3600); 
		ЭлементНачало.СписокВыбора.Добавить(ЗначениеВремени, Формат(ЗначениеВремени, "ДФ=ЧЧ:мм"));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыпадающийСписокОкончания()
	
	БазоваяДата = '00010101'; 
	ЭлементКонец = Элементы.ВремяОкончанияРабот;
	ЭлементКонец.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРабот) Тогда
		ЧасНачала = Час(Объект.ВремяНачалаРабот) + 1;
	Иначе
		ЧасНачала = 9; 
	КонецЕсли;
	
	Для Час = ЧасНачала По 21 Цикл
		ЗначениеВремени = БазоваяДата + (Час * 3600); 
		ЭлементКонец.СписокВыбора.Добавить(ЗначениеВремени, Формат(ЗначениеВремени, "ДФ=ЧЧ:мм"));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыпадающийСписокОкончанияНаСервере()
	ЗаполнитьВыпадающийСписокОкончания();
КонецПроцедуры

	// Отображение только Специалистов на форме
	
&НаСервереБезКонтекста
Функция ПолучитьСписокСпециалистовНаСервере()
	
	МассивСпецов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВКМ_УсловияОплатыСотрудников.Сотрудник КАК Сотрудник
			|ИЗ
			|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудников
			|ГДЕ
			|	ВКМ_УсловияОплатыСотрудников.Категория = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорииСотрудников.Специалисты)";
		
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивСпецов.Добавить(Выборка.Сотрудник);
	КонецЦикла;

	Возврат Новый ФиксированныйМассив(МассивСпецов);
	
КонецФункции

	// ВКМ Супонев - Дипломный проект
	// +++
	
#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

#КонецОбласти
